Revit 2027 API
ParameterTypeId.AllowAutoEmbed Property
 "Automatically Embed"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AllowAutoEmbed { get; }
Public Shared ReadOnly Property AllowAutoEmbed As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AllowAutoEmbed {
	ForgeTypeId^ get ();
}
static member AllowAutoEmbed : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace